espressif/idf-extra-components/raylib/examples/esp32/m5stack-core2_hello/sdkconfig.defaults
# ESP-IDF Configuration
# Target is determined by the board selection

CONFIG_IDF_TARGET=esp32

# PSRAM Configuration for boards that support it
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768
